Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
/*******************************************************************************
* File Name        : usb_camera_task.c
*
* Description      : This file implements the USB Webcam functions.
*
* Related Document : See README.md
*
********************************************************************************
 * (c) 2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG. All rights reserved.
 * This software, associated documentation and materials ("Software") is
 * owned by Infineon Technologies AG or one of its affiliates ("Infineon")
 * and is protected by and subject to worldwide patent protection, worldwide
 * copyright laws, and international treaty provisions. Therefore, you may use
 * this Software only as provided in the license agreement accompanying the
 * software package from which you obtained this Software. If no license
 * agreement applies, then any use, reproduction, modification, translation, or
 * compilation of this Software is prohibited without the express written
 * permission of Infineon.
 *
 * Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 * IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
 * THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
 * SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
 * Infineon reserves the right to make changes to the Software without notice.
 * You are responsible for properly designing, programming, and testing the
 * functionality and safety of your intended application of the Software, as
 * well as complying with any legal requirements related to its use. Infineon
 * does not guarantee that the Software will be free from intrusion, data theft
 * or loss, or other breaches ("Security Breaches"), and Infineon shall have
 * no liability arising out of any Security Breaches. Unless otherwise
 * explicitly approved by Infineon, the Software may not be used in any
 * application where a failure of the Product or any consequences of the use
 * thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "cybsp.h"
#include "cy_pdl.h"
/* FreeRTOS header file */
#include "FreeRTOS.h"
#include "task.h"
#include "event_groups.h"
#include "queue.h"
#include "semphr.h"
#include "USBH.h"
#include "USBH_Util.h"
#include "USBH_VIDEO.h"
#include <stdio.h>
#include "definitions.h"
#include "lcd_task.h"
#include "usb_camera_task.h"
#include "time_utils.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)

/* USB task configuration macros */
#define USBH_TASK_STACK_SIZE_BYTES          ( 8192U )

/* USB device configuration macros */
#define USB_DEVICE_CONNECTED                ( 1U )
#define USB_DEVICE_DISCONNECTED             ( 0U )
#define USB_DISCONNECT_EVENT                ( 0xFFU )

/* Frame processing macros */
#define FRAME_TIMEOUT_MS                    ( 10000U )  /* 10 seconds */
#define DEVICE_INIT_TIMEOUT_MS              ( 5000.0f )   /* 5 seconds */
#define TERMINAL_ENUM_DELAY_MS              ( 10U )
#define FRAME_DISCOVERY_DELAY_MS            ( 10U )

/* Error handling macros */
#define USB_STREAM_ERROR_THRESHOLD          ( 10U )

/* Buffer management macros */
#define FRAME_BYTES_RESET                   ( 0U )
#define QUEUE_GET_TIMEOUT_MS                ( 100U )

#define USB_DEVICE_DISCONNECT_WAIT_MS       (50U)
#define USB_DEFAULT_FRAME_INTERVAL_IDX      (1U)
#define USB_SECONDS_TO_100NS                (10000000U)

#define INITIAL_VAL                         (0)

/*******************************************************************************
* Global Variables
*******************************************************************************/
static TaskHandle_t usbh_main_task_handle;
static TaskHandle_t usbh_isr_task_handle;

static QueueHandle_t video_mail_box;
static QueueHandle_t device_state_mailbox;

static U8 avideo_dev_Indexes[MAX_VIDEO_INTERFACES] __attribute__((used));
static char _ac[128];
static char ac_mb_event[1] __attribute__((used));
static USBH_NOTIFICATION_HOOK   Hook;

uint8_t _device_connected;
uint8_t lastBuffer;
bool logitech_camera_enabled = 0;
bool point3mp_camera_enabled = 0;
bool twomp_camera_enabled = 0;
bool camera_not_supported = 0;

/* Frame monitoring variables */
float last_frame_time = 0;
float last_check_time = 0;
static int stream_err_cnt;
float frame_timeout_ms = 10000; /* 10 seconds without frames is considered stalled */

cy_queue_t _NewFrameMailBox;

video_buffer_t    image_buff[NUM_IMAGE_BUFFERS];

/*******************************************************************************
* Functions
*******************************************************************************/

/*******************************************************************************
* Function Name: USBH_Task_Wrapper
********************************************************************************
* Description:
* Task wrapper function for the USB host task. This function is responsible for
* invoking the USBH_Task function, which performs the actual USB host operations
* The function takes a void pointer as an argument, but it is not used
*
* Input Arguments:
*   void *arg - Unused argument
*
*
*
* Return Value:
*   None
*
********************************************************************************/
void USBH_Task_Wrapper(void *arg) {
    (void)arg;
    USBH_Task();
}

/*******************************************************************************
* Function Name: USBH_Task_Wrapper_new
********************************************************************************
* Description:
* Task wrapper function for the USB host interrupt service task. This function
* is responsible for invoking the USBH_ISRTask function, which performs the actual
* USB host interrupt service operations. The function takes a void pointer as an
* argument, but it is not used.
*
* Input Arguments:
*   void *arg - Unused argument
*
*
*
* Return Value:
*   None
*
********************************************************************************/
void USBH_Task_Wrapper_new(void *arg) {
    (void)arg;
    USBH_ISRTask();
}

