Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
/*******************************************************************************
* Function Name: cb_Onadd_remove_device
********************************************************************************
* Description:
*   Callback function invoked when a USB device is added or removed. Executes in
*   the context of the USBH_Task and handles device connection/disconnection events
*   by updating buffers, logging events, and signaling tasks. Non-blocking.
*
* Input Arguments:
*   void *pContext - Context pointer (not used)
*   U8 DevIndex - Index of the device
*   USBH_DEVICE_EVENT Event - Event type (add or remove)
*
* Return Value:
*   None
*
*******************************************************************************/
static void cb_Onadd_remove_device ( void *pContext, U8 DevIndex, USBH_DEVICE_EVENT Event )
{
    (void) pContext;

    switch ( Event )
    {
        case USBH_DEVICE_EVENT_ADD :
            _device_connected = USB_DEVICE_CONNECTED;
            USBH_Logf_Application("**** VIDEO Device added [%d]\n", DevIndex);
            for (int i = INITIAL_VAL; i < NUM_IMAGE_BUFFERS; i++)
            {
                image_buff[i].BufReady = INITIAL_VAL;
                image_buff[i].NumBytes = INITIAL_VAL;
            }
            lastBuffer = INITIAL_VAL;
            __DMB();
           xQueueSend(video_mail_box, &DevIndex, INITIAL_VAL);

            break;
         case USBH_DEVICE_EVENT_REMOVE :
            _device_connected = USB_DEVICE_DISCONNECTED;
            USBH_Logf_Application("**** VIDEO Device removed [%d]\n", DevIndex);

            /* Reset buffer states */
            for (int i = 0; i < NUM_IMAGE_BUFFERS; i++) 
            {
                image_buff[i].BufReady = INITIAL_VAL;
                image_buff[i].NumBytes = INITIAL_VAL;
            }
            __DMB();
            /* Signal main task about disconnection */
            U8 disconnectEvent = USB_DISCONNECT_EVENT;
            xQueueSend(device_state_mailbox, &disconnectEvent, INITIAL_VAL);

            xSemaphoreGive(model_semaphore);
            stream_err_cnt = INITIAL_VAL;
            break;
        default :
            break; /* Should never happen */
    }
}

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: usb_cb_on_data
********************************************************************************
* Description:
*   Callback function invoked when video data is received from a USB video device.
*   Manages frame buffering, error handling, and stream state for video data
*   processing. Updates buffer states, signals semaphores, and handles frame
*   completion or errors.
*
* Input Arguments:
*   USBH_VIDEO_DEVICE_HANDLE hDevice - Handle to the video device (not used)
*   USBH_VIDEO_STREAM_HANDLE hStream - Handle to the video stream
*   USBH_STATUS Status - Status of the data transfer
*   const U8 *pData - Pointer to the received data
*   unsigned NumBytes - Number of bytes received
*   U32 Flags - Flags indicating frame status
*   void *pUserDataContext - User context pointer (not used)
*
* Return Value:
*   None
*
********************************************************************************/
static void usb_cb_on_data (
        USBH_VIDEO_DEVICE_HANDLE hDevice,
        USBH_VIDEO_STREAM_HANDLE hStream,
        USBH_STATUS Status,
        const U8    *pData,
        unsigned    NumBytes,
        U32         Flags,
        void        *pUserDataContext )
{
    (void) pData;
    (void) hDevice;
    (void) pUserDataContext;

    static size_t   _frame_bytes = INITIAL_VAL;
    static uint8_t  _throw_away_frame = INITIAL_VAL;
    static uint8_t  _current_Buffer = INITIAL_VAL;
    static uint16_t _frame_count = INITIAL_VAL;
    USBH_STATUS Status1;
    I8 IsStreamStopped;
    BaseType_t result;

    /* Check if USB is ready to transmit */
    if ( Status == USBH_STATUS_SUCCESS )
    {
            stream_err_cnt = 0;

        bool    endOfFrame = (Flags & USBH_UVC_END_OF_FRAME) == USBH_UVC_END_OF_FRAME;


        if( !point3mp_camera_enabled )
        {
            if(!logitech_camera_enabled)
                _throw_away_frame |= (_frame_count % FRAMES_TO_SKIP);
            else
                _throw_away_frame |= (_frame_count % FRAMES_TO_SKIP_LOGITECH);
        }

        if ( _frame_bytes + NumBytes > CAMERA_BUFFER_SIZE ) {
            printf( "[USB Camera] Buffer overflow: %u (%6u)\r\n", _current_Buffer, _frame_bytes + NumBytes );
            _throw_away_frame = 1;
            _frame_bytes = FRAME_BYTES_RESET;
        }

        if ( _throw_away_frame ) 
        {
            if ( endOfFrame ) 
            {
                _frame_count++;
                _frame_bytes = FRAME_BYTES_RESET;
                _throw_away_frame = image_buff[_current_Buffer].BufReady;
            }
            USBH_VIDEO_Ack(hStream);
            return;
        }

        /* Copy data into the current buffer. */
      
        memcpy( ((uint8_t *)usb_yuv_frames[_current_Buffer].memory) + _frame_bytes, pData,NumBytes );

        
        _frame_bytes += NumBytes;
        /* Switch buffers when a buffer is full or when we register an end-of-frame. */
        if ( endOfFrame )
        {
            _frame_count++;
            

            if ( _frame_bytes == CAMERA_BUFFER_SIZE )
             { 
                /* processing of the previous frame is DONE, no ready buffer, and wait for a new ready frame */
                lastBuffer = _current_Buffer;
                image_buff[_current_Buffer].BufReady = 1;
                image_buff[_current_Buffer].NumBytes = _frame_bytes;

                __DMB();

                /* Switch to next buffer */
                _current_Buffer = (_current_Buffer + 1) % NUM_IMAGE_BUFFERS;
                /* If there is only ONE buffer, throw away next frames until processing is completed */
                _throw_away_frame = image_buff[_current_Buffer].BufReady;

                if(!logitech_camera_enabled)
                {
                    result = xSemaphoreTake(usb_semaphore, portMAX_DELAY);
                    if (result != pdPASS)
                    {
                        printf("[USB Camera] USB Semaphore take failed\r\n");
                    }
                }
                else
                {
                    xSemaphoreGive(usb_semaphore);
                }
            }
            _frame_bytes = FRAME_BYTES_RESET;
        }

        USBH_VIDEO_Ack(hStream);
        
