Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
    } 
    else
    {
        stream_err_cnt++;
        if (stream_err_cnt >= USB_STREAM_ERROR_THRESHOLD)
        {
             Status1 = USBH_STATUS_DEVICE_ERROR; /* Indicate failure */
        }
        else
        {
            if ((Status != USBH_STATUS_DEVICE_REMOVED))
            {
               Status1 = USBH_VIDEO_GetStreamState(hStream, &IsStreamStopped);
               if (Status1 == USBH_STATUS_SUCCESS)
                {
                 if (IsStreamStopped)
                  {
                     Status1 = USBH_VIDEO_RestartStream(hStream);
                   if (Status1== USBH_STATUS_SUCCESS)
                    {
                     USBH_Logf_Application("usb_cb_on_data: Restarted video stream after packet error");
                    }
                    else
                    {
                     USBH_Logf_Application("usb_cb_on_data: USBH_VIDEO_RestartStream failed %s", USBH_GetStatusStr(Status));
                    }
                }
                else
                {
                   USBH_Warnf_Application("usb_cb_on_data: stream_err_cnt %d, but stream is running", stream_err_cnt);

                }
               }
                else
                {
                 USBH_Logf_Application("usb_cb_on_data: USBH_VIDEO_GetStreamState failed %s", USBH_GetStatusStr(Status));
                 }
            }
           }

        /* If the consecutive error count reaches max,
            the device was disconnected,
            or the stream could not be restarted - remove the video device. */

           if ((Status == USBH_STATUS_DEVICE_REMOVED) ||
               (Status1  != USBH_STATUS_SUCCESS))
            {
             USBH_Logf_Application("usb_cb_on_data device removed or max conseq. errors exceeded");

             xQueueSend(device_state_mailbox, (uint8_t*)0xFF, 0);
             stream_err_cnt = 0;
            }

        /* Reset frame state on error but don't change buffer states */
        _frame_bytes = FRAME_BYTES_RESET;
        _throw_away_frame = 0;
        USBH_VIDEO_Ack(hStream);
        return;
               
    }
}
CY_SECTION_ITCM_END

/*******************************************************************************
* Function Name: get_frame_intervals
********************************************************************************
* Description:
*   Retrieves and formats frame interval information for a video frame into a
*   string buffer for logging or display purposes.
*
* Input Arguments:
*   USBH_VIDEO_FRAME_INFO *pFrame - Pointer to the frame information structure
*
* Return Value:
*   None
*
*******************************************************************************/
static void get_frame_intervals ( USBH_VIDEO_FRAME_INFO *pFrame )
{
    char ac[32];
    unsigned i;

    USBH_MEMSET(_ac, 0, sizeof(_ac));
    USBH_MEMSET(ac, 0, sizeof(ac));
    for ( i = 0; i < pFrame->bFrameIntervalType; i++ )
    {
        if ( i == 0 )
        {
            SEGGER_snprintf(ac, sizeof(ac), "%lu", pFrame->u.dwFrameInterval[i]);
        }
        else
        {
            SEGGER_snprintf(ac, sizeof(ac), ", %lu", pFrame->u.dwFrameInterval[i]);
        }
        strncat(_ac, ac, sizeof(_ac) - (strlen(_ac) + 1));
    }
}

/*******************************************************************************
* Function Name: term_type2str
********************************************************************************
* Description:
*   Converts a terminal type code to a human-readable string representation.
*
* Input Arguments:
*   U8 Type - Terminal type code
*
* Return Value:
*   const char* - String representation of the terminal type
*
********************************************************************************/
static const char* term_type2str ( U8 Type )
{
    switch ( Type )
    {
        case USBH_VIDEO_VC_INPUT_TERMINAL :
            return "Input";
        case USBH_VIDEO_VC_OUTPUT_TERMINAL :
            return "Output";
        case USBH_VIDEO_VC_SELECTOR_UNIT :
            return "Selector";
        case USBH_VIDEO_VC_PROCESSING_UNIT :
            return "Processing";
        case USBH_VIDEO_VC_EXTENSION_UNIT :
            return "Extension";
        default :
            return "Unknown";
    }
}


/*******************************************************************************
* Function Name: format_type2str
********************************************************************************
* Description:
*   Converts a video format type code to a human-readable string representation.
*
* Input Arguments:
*   U8 Type - Video format type code
*
* Return Value:
*   const char* - String representation of the video format type
*
********************************************************************************/
static const char* format_type2str ( U8 Type )
{
    switch ( Type )
    {
        case USBH_VIDEO_VS_FORMAT_UNCOMPRESSED :
            return "Uncompressed";
        case USBH_VIDEO_VS_FORMAT_MJPEG :
            return "MJPEG";
        case USBH_VIDEO_VS_FORMAT_FRAME_BASED :
            return "H.264";
        default :
            return "Unknown";
    }
}

/*******************************************************************************
* Function Name: frame_type2str
********************************************************************************
* Description:
*   Converts a video frame type code to a human-readable string representation.
*
* Input Arguments:
*   U8 Type - Video frame type code
*
* Return Value:
*   const char* - String representation of the video frame type
*
*******************************************************************************/
static const char* frame_type2str ( U8 Type )
{
    switch ( Type )
    {
        case USBH_VIDEO_VS_FRAME_UNCOMPRESSED :
            return "Uncompressed";
        case USBH_VIDEO_VS_FRAME_MJPEG :
            return "MJPEG";
        case USBH_VIDEO_VS_FRAME_FRAME_BASED :
            return "H.264";
        default :
            return "Unknown";
    }
}

/*******************************************************************************
* Function Name: print_Input_term_info
********************************************************************************
* Description:
*   Logs information about an input terminal, specifically for camera terminals.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal information structure
*
* Return Value:
*   None
*
********************************************************************************/
static void print_Input_term_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    if ( pTermInfo->u.Terminal.TerminalType != USBH_VIDEO_ITT_CAMERA )
    {
        USBH_Logf_Application("  Input terminal type 0x%x is not handled...", pTermInfo->u.Terminal.TerminalType);
    }
    else
    {
        USBH_Logf_Application("  Associated terminal ID %d", pTermInfo->u.Terminal.u.CameraTerm.bAssocTerminal);
        USBH_Logf_Application(
                "  Objective focal length min %d",
                pTermInfo->u.Terminal.u.CameraTerm.wObjectiveFocalLengthMin);
        USBH_Logf_Application(
                "  Objective focal length max %d",
                pTermInfo->u.Terminal.u.CameraTerm.wObjectiveFocalLengthMax);
        USBH_Logf_Application("  Ocular focal length %d", pTermInfo->u.Terminal.u.CameraTerm.wOcularFocalLength);
        USBH_Logf_Application("  Control Size %d", pTermInfo->u.Terminal.u.CameraTerm.bControlSize);
    }
}

