Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
/*******************************************************************************
* Function Name: print_output_term_info
********************************************************************************
* Description:
*   Logs information about an output terminal, specifically for streaming terminals.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal information structure
*
* Return Value:
*   None
*
********************************************************************************/
static void print_output_term_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    if ( pTermInfo->u.Terminal.TerminalType != USBH_VIDEO_TT_STREAMING )
    {
        USBH_Logf_Application("  Output terminal type 0x%x is not handled...", pTermInfo->u.Terminal.TerminalType);
    }
    else
    {
        USBH_Logf_Application("  Associated terminal ID %d", pTermInfo->u.Terminal.u.OutputTerm.bAssocTerminal);
        USBH_Logf_Application("  Source ID %d", pTermInfo->u.Terminal.u.OutputTerm.bSourceID);
    }
}

/*******************************************************************************
* Function Name: print_selector_unit_info
********************************************************************************
* Description:
*   Logs information about a selector unit, including its input pins.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal information structure
*
* Return Value:
*   None
*
********************************************************************************/
static void print_selector_unit_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    unsigned i;

    USBH_Logf_Application("  Unit ID %d", pTermInfo->bTermUnitID);
    USBH_Logf_Application("  Number of pins %d", pTermInfo->u.SelectUnit.bNrInPins);
    for ( i = 0; i < pTermInfo->u.SelectUnit.bNrInPins; i++ )
    {
        USBH_Logf_Application("  Input pin: %d", pTermInfo->u.SelectUnit.baSourceID[i]);
    }
}

/*******************************************************************************
* Function Name: print_processing_unit_info
********************************************************************************
* Description:
*   Logs information about a processing unit, including its source and control details.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal information structure
*
* Return Value:
*   None
*
********************************************************************************/
static void print_processing_unit_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    USBH_Logf_Application("  Unit ID %d", pTermInfo->bTermUnitID);
    USBH_Logf_Application("  Source ID %d", pTermInfo->u.ProcessUnit.bSourceID);
    USBH_Logf_Application("  Max multiplier %d", pTermInfo->u.ProcessUnit.wMaxMultiplier);
    USBH_Logf_Application("  Control size %d", pTermInfo->u.ProcessUnit.bControlSize);
}

/*******************************************************************************
* Function Name: print_extension_unit_info
*******************************************************************************
* Description:
*   Logs information about an extension unit, including its GUID, pins, and controls.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal information structure
*
* Return Value:
*   None
*
*******************************************************************************/
static void print_extension_unit_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    USBH_Logf_Application("  Unit ID %d", pTermInfo->bTermUnitID);
    USBH_Logf_Application("  Unit GUID 0x%x...", pTermInfo->u.ExtUnit.guidExtensionCode[0]);
    USBH_Logf_Application("  Number of pins %d", pTermInfo->u.ExtUnit.bNrInPins);
    USBH_Logf_Application("  Controls size %d", pTermInfo->u.ExtUnit.bControlSize);
}

/*******************************************************************************
* Function Name: print_term_unit_info
********************************************************************************
* Description:
*   Logs information about a terminal or unit based on its type, delegating to
*   specific print functions for different unit types. Adds a small delay to
*   prevent flooding terminal output.
*
* Input Arguments:
*   USBH_VIDEO_TERM_UNIT_INFO *pTermInfo - Pointer to the terminal or unit information structure
*
* Return Value:
*   None
*
********************************************************************************/
static void print_term_unit_info ( USBH_VIDEO_TERM_UNIT_INFO *pTermInfo )
{
    USBH_Logf_Application("  Terminal/Unit ID %d type %s", pTermInfo->bTermUnitID, term_type2str(pTermInfo->Type));
    switch ( pTermInfo->Type )
    {
        case USBH_VIDEO_VC_INPUT_TERMINAL :
            print_Input_term_info(pTermInfo);
            break;
        case USBH_VIDEO_VC_OUTPUT_TERMINAL :
            print_output_term_info(pTermInfo);
            break;
        case USBH_VIDEO_VC_SELECTOR_UNIT :
            print_selector_unit_info(pTermInfo);
            break;
        case USBH_VIDEO_VC_PROCESSING_UNIT :
            print_processing_unit_info(pTermInfo);
            break;
        case USBH_VIDEO_VC_EXTENSION_UNIT :
            print_extension_unit_info(pTermInfo);
            break;
        default :
            USBH_Logf_Application("  Type %d is not handled...", pTermInfo->Type);
            break;
    }
    USBH_Logf_Application("---------------");
    vTaskDelay(pdMS_TO_TICKS(TERMINAL_ENUM_DELAY_MS)); /* Small delay so that we do not flood terminal output */
}

/*******************************************************************************
* Function Name: On_dev_ready
********************************************************************************
* Description:
*   Handles the initialization and configuration of a USB video device when it is
*   ready. Enumerates terminals, formats, and frames, configures the video stream,
*   and manages frame reception until the device is disconnected or an error occurs.
*
* Input Arguments:
*   U8 DevIndex - Index of the video device
*
* Return Value:
*   None
*
********************************************************************************/
static void On_dev_ready ( U8 DevIndex )
{
    USBH_VIDEO_INPUT_HEADER_INFO InputHeaderInfo;
    USBH_VIDEO_DEVICE_HANDLE hDevice;
    USBH_VIDEO_INTERFACE_INFO IfaceInfo;
    USBH_VIDEO_TERM_UNIT_INFO TermInfo;
    USBH_VIDEO_STREAM_CONFIG StreamInfo;
    USBH_VIDEO_COLOR_INFO ColorInfo;
    USBH_VIDEO_STREAM_HANDLE Stream;
    USBH_VIDEO_FORMAT_INFO Format;
    USBH_VIDEO_FRAME_INFO Frame;
    USBH_STATUS Status;
    unsigned RequestedFrameIntervalIdx;
    unsigned RequestedFormatIdx;
    unsigned RequestedFrameIdx;
    unsigned NumFrameDescriptors;
    unsigned Found;
    unsigned i;
    unsigned j;
    unsigned k;
    int r;
    U8 MBEvent;
    U32 FrameIntervalfrmvidpid;

    /* Open the device, the device index is retrieved from the notification callback */
    RequestedFormatIdx = 0;
    RequestedFrameIdx = 0;
    RequestedFrameIntervalIdx = 0;
    Found = 0;

    memset( &hDevice, 0, sizeof(hDevice) );
    memset( &Stream, 0, sizeof(Stream) );
    /* Add timeout tracking for device initialization */
    float timeout_start_time = ifx_time_get_ms_f();
    float timeout_ms = DEVICE_INIT_TIMEOUT_MS; /* 5 seconds timeout */

    Status = USBH_VIDEO_Open(DevIndex, &hDevice);
    if ( Status != USBH_STATUS_SUCCESS )
    {
        USBH_Logf_Application("USBH_VIDEO_Open returned with error: %s", USBH_GetStatusStr(Status));
        return;
    }

