Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
    Status = USBH_VIDEO_GetInterfaceInfo(hDevice, &IfaceInfo);
    if ( Status != USBH_STATUS_SUCCESS )
    {
        USBH_Logf_Application("USBH_VIDEO_GetInterfaceInfo returned with error: %s", USBH_GetStatusStr(Status));
        return;
    }
    USBH_Logf_Application("====================================================================");
    USBH_Logf_Application("Vendor  Id = 0x%0.4X", IfaceInfo.VendorId);
    USBH_Logf_Application("Product Id = 0x%0.4X", IfaceInfo.ProductId);

    if((LOGI_TECH_C920_VID == IfaceInfo.VendorId) && (LOGI_TECH_C920_PID == IfaceInfo.ProductId))
    {
        camera_not_supported = 0;
        FrameIntervalfrmvidpid = FRAME_INTERVAL_1;
        logitech_camera_enabled = 1;
        point3mp_camera_enabled = 0;
        twomp_camera_enabled = 0;
    }
    else if((HBV_CAM_0P3_VID == IfaceInfo.VendorId) && (HBV_CAM_0P3_PID == IfaceInfo.ProductId))
    {
        camera_not_supported = 0;
        FrameIntervalfrmvidpid = FRAME_INTERVAL_2;
        logitech_camera_enabled = 0;
        point3mp_camera_enabled = 1;
        twomp_camera_enabled = 0;
    }
    else if((HBV_CAM_2P0_VID == IfaceInfo.VendorId) && (HBV_CAM_2P0_PID == IfaceInfo.ProductId))
    {
        camera_not_supported = 0;
        FrameIntervalfrmvidpid = FRAME_INTERVAL;
        logitech_camera_enabled = 0;
        point3mp_camera_enabled = 0;
        twomp_camera_enabled = 1;
    }
    else
    {
        xSemaphoreGive(model_semaphore);
        camera_not_supported = 1;
        return;
    }

    /* List all terminals/units */
    for ( i = 0; i < IfaceInfo.NumTermUnits; i++ )
    {
        /* Check if we've been waiting too long for initialization */
        if ((ifx_time_get_ms_f() - timeout_start_time) > timeout_ms)
        {
            USBH_Logf_Application("Timeout waiting for device initialization during terminal enumeration. \
                                    Resetting...");
            Found = 0;
            goto cleanup; /* Exit and cleanup */
        }

        Status = USBH_VIDEO_GetTermUnitInfo( hDevice, i, &TermInfo );
        if ( Status == USBH_STATUS_SUCCESS )
        {
            print_term_unit_info(&TermInfo);

        } 
        else 
        {
            USBH_Logf_Application("USBH_VIDEO_GetTermUnitInfo returned with error: %s", USBH_GetStatusStr(Status));
        }
    }


    /* This sets the text information fields and the webcam frame window visible. */

    memset( &IfaceInfo, 0, sizeof(IfaceInfo) );
    if ( Status != USBH_STATUS_SUCCESS && Status != USBH_STATUS_NOT_FOUND )
    {
        USBH_Logf_Application("USBH_VIDEO_GetFirstTermUnitInfo returned with error: %s", USBH_GetStatusStr(Status));
    } 
    else
    {

        /* Configure the VIDEO device */

        Status = USBH_VIDEO_GetInputHeader( hDevice, &InputHeaderInfo );
        if ( Status != USBH_STATUS_SUCCESS )
        {
            USBH_Logf_Application("USBH_VIDEO_GetInputHeader returned with error: %s", USBH_GetStatusStr(Status));
        } 
        else
        {
            USBH_Logf_Application(
                    "Video Interface with index %d (%d formats reported, still capture method %d):",
                    DevIndex,
                    InputHeaderInfo.bNumFormats,
                    InputHeaderInfo.bStillCaptureMethod);

            /* Iterate over all formats */

            for ( i = 0; i < InputHeaderInfo.bNumFormats; i++ )
            {
                /* Check if we've been waiting too long for initialization */
                if ((ifx_time_get_ms_f() - timeout_start_time) > timeout_ms)
                {
                    USBH_Logf_Application("Timeout waiting for device initialization during format discovery. \
                                            Resetting...");
                    Found = 0;
                    break;
                }

                Status = USBH_VIDEO_GetFormatInfo(hDevice, i, &Format);
                if ( Status != USBH_STATUS_SUCCESS )
                {
                    USBH_Logf_Application(
                            "USBH_VIDEO_GetFormatInfo returned with error: %s",
                            USBH_GetStatusStr(Status));
                }
                else
                {
                    switch ( Format.FormatType )
                    {
                        case USBH_VIDEO_VS_FORMAT_UNCOMPRESSED :
                            NumFrameDescriptors = Format.u.UncompressedFormat.bNumFrameDescriptors;
                            break;
                        case USBH_VIDEO_VS_FORMAT_MJPEG :
                            NumFrameDescriptors = Format.u.MJPEG_Format.bNumFrameDescriptors;
                            break;
                        case USBH_VIDEO_VS_FORMAT_FRAME_BASED :
                            NumFrameDescriptors = Format.u.H264_Format.bNumFrameDescriptors;
                            break;
                        default :
                            USBH_Logf_Application("  Format type %d is not supported!:", Format.FormatType);
                            Status = USBH_STATUS_ERROR;
                    }

                    /* If we have a valid format type - proceed with parsing */

                    if ( Status == USBH_STATUS_SUCCESS )
                    {
                        USBH_Logf_Application("  Format Index %d, type %s:", i, format_type2str(Format.FormatType));

                        /* Check if the format has a color matching descriptor */

                        Status = USBH_VIDEO_GetColorMatchingInfo(hDevice, i, &ColorInfo);
                        if ( Status != USBH_STATUS_SUCCESS )
                        {
                            USBH_Logf_Application("  No color matching descriptor (%s)", USBH_GetStatusStr(Status));
                        }
                        else
                        {
                            USBH_Logf_Application(
                                    "  Color matching descriptor: bColorPrimaries 0x%x, "
                                    "bTransferCharacteristics 0x%x, "
                                    "bMatrixCoefficients 0x%x",
                                    ColorInfo.bColorPrimaries,
                                    ColorInfo.bTransferCharacteristics,
                                    ColorInfo.bMatrixCoefficients);
                        }

