Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
                        /* Iterate over all frame types */

                        for ( j = 0; j < NumFrameDescriptors; j++ )
                        {
                            /* Check timeout during frame discovery */
                            if ((ifx_time_get_ms_f() - timeout_start_time) > timeout_ms)
                            {
                                USBH_Logf_Application("Timeout waiting for device initialization during frame discovery."
                                                        "Resetting...");
                                Found = 0;
                                break; /* Exit frame discovery loop */
                            }

                            Status = USBH_VIDEO_GetFrameInfo(hDevice, i, j, &Frame);
                            if ( Status != USBH_STATUS_SUCCESS )
                            {
                                USBH_Logf_Application(
                                        "USBH_VIDEO_GetFrameInfo returned with error: %s",
                                        USBH_GetStatusStr(Status));
                            }
                            else
                            {
                                if ( Frame.bFrameIntervalType == 0 )
                                {
                                    USBH_Logf_Application(
                                            "    Frame Index %d, type %s, x %d, y %d, %d min frame interval, "
                                            "%d max frame interval, %d interval step",
                                            j,
                                            frame_type2str(Frame.FrameType),
                                            Frame.wWidth,
                                            Frame.wHeight,
                                            Frame.bFrameIntervalType,
                                            Frame.u.dwMinFrameInterval,
                                            Frame.u.dwMaxFrameInterval,
                                            Frame.u.dwFrameIntervalStep);
                                }
                                else
                                {
                                    get_frame_intervals(&Frame);
                                    USBH_Logf_Application(
                                            "    Frame Index %d, type %s, x %d, y %d, intervals (%d): { %s }",
                                            j,
                                            frame_type2str(Frame.FrameType),
                                            Frame.wWidth,
                                            Frame.wHeight,
                                            Frame.bFrameIntervalType,
                                            _ac);

                                    /* Try to find a setting which matches our defines */

                                    if ( Format.FormatType == FORMAT )
                                    {
                                        if ( (Frame.wHeight == CAMERA_HEIGHT) && (Frame.wWidth == CAMERA_WIDTH) )
                                        {
                                            for ( k = 0; k < Frame.bFrameIntervalType; k++ )
                                            {
                                                if ( Frame.u.dwFrameInterval[k] == FrameIntervalfrmvidpid )
                                                {
                                                    if ( Found != 1u ) 
                                                    {
                                                        RequestedFormatIdx = i;
                                                        RequestedFrameIdx = j;
                                                        RequestedFrameIntervalIdx = k + USB_DEFAULT_FRAME_INTERVAL_IDX;
                                                        Found = 1;
                                                        USBH_Logf_Application(
                                                            "--->Found requested setting (%dx%d @ %d FPS): "
                                                            "Format Index %d, Frame Index %d, Frame Interval Index %d",
                                                            CAMERA_WIDTH,
                                                            CAMERA_HEIGHT,
                                                            USB_SECONDS_TO_100NS / Frame.u.dwFrameInterval[k],
                                                            RequestedFormatIdx,
                                                            RequestedFrameIdx,
                                                            RequestedFrameIntervalIdx);
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                                /* Small delay so that we do not flood terminal output */
                                vTaskDelay(pdMS_TO_TICKS(FRAME_DISCOVERY_DELAY_MS)); 
                            }
                        }
                    }
                }
            }

            /* If we didn't find an exact format match, try to use first available format */
            if (Found != 1u && InputHeaderInfo.bNumFormats > 0)
            {
                USBH_Logf_Application(
                    "WARNING: Couldn't find exact requested format. "
                    "Using first available format instead.");
                /* Fall back to first available format if any exist */
                RequestedFormatIdx = 0;
                RequestedFrameIdx = 0;
                RequestedFrameIntervalIdx = USB_DEFAULT_FRAME_INTERVAL_IDX; /* First interval */
                Found = 1;
            }
        }

        /* Receive frame data */
        memset(&StreamInfo, 0, sizeof(USBH_VIDEO_STREAM_CONFIG));
        StreamInfo.Flags = 0;
        if ( Found == 1u )
        {
            StreamInfo.FormatIdx       = RequestedFormatIdx;
            StreamInfo.FrameIdx        = RequestedFrameIdx;
            StreamInfo.FrameIntervalIdx = RequestedFrameIntervalIdx;
            StreamInfo.pfDataCallback   = usb_cb_on_data;
            lastBuffer = 0;
            last_check_time = ifx_time_get_ms_f();
            xQueueReset(device_state_mailbox);
            Status = USBH_VIDEO_OpenStream( hDevice, &StreamInfo, &Stream );
            if ( Status != USBH_STATUS_SUCCESS )
            {
                USBH_Logf_Application("USBH_VIDEO_OpenStream returned with error: %s", USBH_GetStatusStr(Status));
            }
            else
            {

