Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/usb_camera_task.c
                /* Wait until the device has been disconnected */

                for ( ;; )
                {
                    /* Check for stalled camera frames */
                    float current_time = ifx_time_get_ms_f();
                    if ((current_time - last_check_time) > 1000)
                    { 
                        /* Check once per second */
                        last_check_time = current_time;

#ifdef ENABLE_USB_WEBCAM_TIMEOUT
                        if (last_frame_time > 0 &&
                            (current_time - last_frame_time) > frame_timeout_ms)
                        {
                            printf("[ERROR] No frames received for %.2f seconds, camera is stalled", 
                                    frame_timeout_ms/1000.0);
                            /* Force camera reset */
                            break;
                        }
#endif /* ENABLE_USB_WEBCAM_TIMEOUT */
                    }
                    /* checking if the queue operation was successful */
                    r = xQueueReceive(device_state_mailbox, &MBEvent, pdMS_TO_TICKS(100));
                    if ( r == pdTRUE )
                    {
                        if (MBEvent == 0xff)
                        {
                            USBH_Logf_Application("USBH_VIDEO_OpenStream breaking - Device was disconnected");
                            break;
                        }
                        else if (MBEvent == 0xfe)
                        {
                            USBH_Logf_Application("USBH_VIDEO_OpenStream breaking - Transfer status error");
                            break;
                        }
                        else
                        {
                            USBH_Logf_Application("USBH_VIDEO_OpenStream received unknown error code: 0x%02x", MBEvent);

                            if(_device_connected)
                                MBEvent = 0xfe;
                            break;
                        }
                    }
                    else
                    {
                }
            }
        }
        }
        else
        {

            /* Display error text until webcam is removed */

            while ( _device_connected )
            {
                USBH_OS_Delay(USB_DEVICE_DISCONNECT_WAIT_MS);
            }
        }
    }

    cleanup:

        /*  Close the device */

        USBH_Logf_Application("Closing video device...");
        USBH_VIDEO_Close(hDevice);
}


/*******************************************************************************
* Function Name: cm55_usb_webcam_task
********************************************************************************
* Description:
*   Main task for handling USB webcam operations. Initializes USB host and video
*   subsystems, creates tasks for USB handling, sets up mailboxes, and processes
*   device readiness events from the video mailbox.
*
* Input Arguments:
*   void *arg - Task argument (not used)
*
* Return Value:
*   None
*
*******************************************************************************/
void cm55_usb_webcam_task( void *arg )
{
    const uint32_t  task_stack_size_bytes = USBH_TASK_STACK_SIZE_BYTES;
    U8              DevIndex;

    USBH_Init();
    xTaskCreate(USBH_Task_Wrapper, "USBH_Task", task_stack_size_bytes / sizeof(StackType_t), NULL, TASK_PRIO_USBH_MAIN, &usbh_main_task_handle);
    xTaskCreate(USBH_Task_Wrapper_new, "USBH_isr", task_stack_size_bytes / sizeof(StackType_t), NULL, TASK_PRIO_USBH_ISR, &usbh_isr_task_handle);

   video_mail_box = xQueueCreate(SEGGER_COUNTOF(avideo_dev_Indexes), sizeof(U8));
    configASSERT(video_mail_box != NULL);
   device_state_mailbox = xQueueCreate(sizeof(ac_mb_event)/sizeof(U8), sizeof(U8));
    configASSERT(device_state_mailbox != NULL);
    USBH_VIDEO_Init();
    USBH_VIDEO_AddNotification( &Hook, cb_Onadd_remove_device, NULL );

    while ( true ) 
    {

        if ( xQueueReceive(video_mail_box, &DevIndex, pdMS_TO_TICKS(QUEUE_GET_TIMEOUT_MS)) == pdTRUE )
        {
            On_dev_ready(DevIndex);
        }
    }
}

/* [] END OF FILE */